{
  "genus": {
    "value2idx": {
      "unknown": 0,
      "Acanthaceae": 1,
      "Acanthamoebidae": 2,
      "Acanthasteridae": 3,
      "Acaridae": 4,
      "Accipitridae": 5,
      "Acestrorhamphidae": 6,
      "Achatinidae": 7,
      "Achatocarpaceae": 8,
      "Achlyaceae": 9,
      "Acinetosporaceae": 10,
      "Acipenseridae": 11,
      "Acoraceae": 12,
      "Acrididae": 13,
      "Acrobatidae": 14,
      "Acrochordidae": 15,
      "Acroporidae": 16,
      "Actinidiaceae": 17,
      "Actiniidae": 18,
      "Actinopodidae": 19,
      "Actinostolidae": 20,
      "Acytosteliaceae": 21,
      "Adelanthaceae": 22,
      "Adoxaceae": 23,
      "Adrianichthyidae": 24,
      "Adustoporiaceae": 25,
      "Aequoreidae": 26,
      "Aeshnidae": 27,
      "Agamidae": 28,
      "Agaraceae": 29,
      "Agaricaceae": 30,
      "Agelenidae": 31,
      "Agonidae": 32,
      "Ailuridae": 33,
      "Aiptasiidae": 34,
      "Aizoaceae": 35,
      "Ajellomycetaceae": 36,
      "Akaniaceae": 37,
      "Alariaceae": 38,
      "Alatinidae": 39,
      "Alcedinidae": 40,
      "Alcidae": 41,
      "Alcyoniidae": 42,
      "Aleyrodidae": 43,
      "Aliciidae": 44,
      "Alismataceae": 45,
      "Alligatoridae": 46,
      "Alopiidae": 47,
      "Altingiaceae": 48,
      "Alydidae": 49,
      "Alytidae": 50,
      "Amanitaceae": 51,
      "Amaranthaceae": 52,
      "Amaryllidaceae": 53,
      "Amborellaceae": 54,
      "Ambystomatidae": 55,
      "Amiidae": 56,
      "Amoebidae": 57,
      "Amorphothecaceae": 58,
      "Amphidiniaceae": 59,
      "Amphiumidae": 60,
      "Ampulicidae": 61,
      "Ampullariidae": 62,
      "Amylocorticiaceae": 63,
      "Anacampserotaceae": 64,
      "Anacardiaceae": 65,
      "Anarhichadidae": 66,
      "Anatidae": 67,
      "Ancorinidae": 68,
      "Ancylostomatidae": 69,
      "Andrenidae": 70,
      "Anemiaceae": 71,
      "Aneuraceae": 72,
      "Anguillidae": 73,
      "Anhimidae": 74,
      "Anhingidae": 75,
      "Aniliidae": 76,
      "Anisakidae": 77,
      "Annonaceae": 78,
      "Anomaluridae": 79,
      "Anoplocephalidae": 80,
      "Anoplogasteridae": 81,
      "Anoplopomatidae": 82,
      "Anseranatidae": 83,
      "Anthocerotaceae": 84,
      "Anthomyiidae": 85,
      "Antilocapridae": 86,
      "Aotidae": 87,
      "Aphelenchoididae": 88,
      "Aphididae": 89,
      "Apiaceae": 90,
      "Apidae": 91,
      "Apiosporaceae": 92,
      "Aplodontiidae": 93,
      "Aplysiidae": 94,
      "Aplysinidae": 95,
      "Apocynaceae": 96,
      "Apodidae": 97,
      "Apogonidae": 98,
      "Apterygidae": 99,
      "Aquifoliaceae": 100,
      "Araceae": 101,
      "Araliaceae": 102,
      "Araneidae": 103,
      "Araucariaceae": 104,
      "Arbaciidae": 105,
      "Arcidae": 106,
      "Ardeidae": 107,
      "Arecaceae": 108,
      "Arenicolidae": 109,
      "Argasidae": 110,
      "Arhynchobatidae": 111,
      "Aristolochiaceae": 112,
      "Armadillidiidae": 113,
      "Artamidae": 114,
      "Artedidraconidae": 115,
      "Artemiidae": 116,
      "Arthrodermataceae": 117,
      "Asaraceae": 118,
      "Ascaphidae": 119,
      "Ascarididae": 120,
      "Ascidiidae": 121,
      "Ascobolaceae": 122,
      "Asellidae": 123,
      "Asilidae": 124,
      "Asparagaceae": 125,
      "Aspergillaceae": 126,
      "Asphodelaceae": 127,
      "Aspleniaceae": 128,
      "Astacidae": 129,
      "Asteraceae": 130,
      "Asteriidae": 131,
      "Asterinidae": 132,
      "Atelidae": 133,
      "Atheliaceae": 134,
      "Atherinidae": 135,
      "Atherinopsidae": 136,
      "Auriculariaceae": 137,
      "Austrophasmatidae": 138,
      "Axinellidae": 139,
      "Aytoniaceae": 140,
      "Babesiidae": 141,
      "Bacillaceae": 142,
      "Bacillariaceae": 143,
      "Bagridae": 144,
      "Balaenidae": 145,
      "Balaenopteridae": 146,
      "Balanidae": 147,
      "Balsaminaceae": 148,
      "Bangiaceae": 149,
      "Barychelidae": 150,
      "Basellaceae": 151,
      "Bataceae": 152,
      "Bathycoccaceae": 153,
      "Bathydraconidae": 154,
      "Bathyergidae": 155,
      "Batrachoididae": 156,
      "Begoniaceae": 157,
      "Berberidaceae": 158,
      "Betulaceae": 159,
      "Bignoniaceae": 160,
      "Bionectriaceae": 161,
      "Biphyllidae": 162,
      "Bithyniidae": 163,
      "Bixaceae": 164,
      "Blaberidae": 165,
      "Blastocladiaceae": 166,
      "Blastocystidae": 167,
      "Blattellidae": 168,
      "Blattidae": 169,
      "Blechnaceae": 170,
      "Blenniidae": 171,
      "Blepharismidae": 172,
      "Boidae": 173,
      "Bolbitiaceae": 174,
      "Boletaceae": 175,
      "Bolinopsidae": 176,
      "Bolyeridae": 177,
      "Bombinatoridae": 178,
      "Bombycidae": 179,
      "Bondarzewiaceae": 180,
      "Boraginaceae": 181,
      "Botryobasidiaceae": 182,
      "Botryosphaeriaceae": 183,
      "Bovichtidae": 184,
      "Bovidae": 185,
      "Brachionidae": 186,
      "Brachycephalidae": 187,
      "Braconidae": 188,
      "Bradypodidae": 189,
      "Branchiostomatidae": 190,
      "Brassicaceae": 191,
      "Bromeliaceae": 192,
      "Bruniaceae": 193,
      "Bryaceae": 194,
      "Bryopsidaceae": 195,
      "Buccinidae": 196,
      "Bufonidae": 197,
      "Bugulidae": 198,
      "Buprestidae": 199,
      "Burkholderiaceae": 200,
      "Burseraceae": 201,
      "Buthidae": 202,
      "Butomaceae": 203,
      "Buxaceae": 204,
      "Byblidaceae": 205,
      "Cabombaceae": 206,
      "Cactaceae": 207,
      "Caenolestidae": 208,
      "Cafeteriaceae": 209,
      "Calanidae": 210,
      "Callichthyidae": 211,
      "Calliphoridae": 212,
      "Callistosporiaceae": 213,
      "Callithamniaceae": 214,
      "Callorhinchidae": 215,
      "Calycanthaceae": 216,
      "Calyptrosphaeraceae": 217,
      "Cambaridae": 218,
      "Camelidae": 219,
      "Campanulaceae": 220,
      "Camptobasidiaceae": 221,
      "Cancridae": 222,
      "Canellaceae": 223,
      "Canidae": 224,
      "Cannabaceae": 225,
      "Cannaceae": 226,
      "Capnodiaceae": 227,
      "Capparaceae": 228,
      "Caprifoliaceae": 229,
      "Capromyidae": 230,
      "Carabidae": 231,
      "Caraboctonidae": 232,
      "Carangidae": 233,
      "Carcharhinidae": 234,
      "Carcinidae": 235,
      "Cardinalidae": 236,
      "Carettochelyidae": 237,
      "Caricaceae": 238,
      "Carpoglyphidae": 239,
      "Carybdeidae": 240,
      "Caryophyllaceae": 241,
      "Castoridae": 242,
      "Casuariidae": 243,
      "Casuarinaceae": 244,
      "Cathartidae": 245,
      "Catostomidae": 246,
      "Caudinidae": 247,
      "Cavenderiaceae": 248,
      "Caviidae": 249,
      "Cebidae": 250,
      "Cecidomyiidae": 251,
      "Celastraceae": 252,
      "Centrarchidae": 253,
      "Centritractaceae": 254,
      "Centropomidae": 255,
      "Cephalotaceae": 256,
      "Cerambycidae": 257,
      "Ceramiaceae": 258,
      "Ceratobasidiaceae": 259,
      "Ceratocystidaceae": 260,
      "Ceratodontidae": 261,
      "Ceratophryidae": 262,
      "Ceratophyllaceae": 263,
      "Ceratopogonidae": 264,
      "Cercidiphyllaceae": 265,
      "Cercopithecidae": 266,
      "Cerrenaceae": 267,
      "Cervantesiaceae": 268,
      "Cervidae": 269,
      "Chactidae": 270,
      "Chaerilidae": 271,
      "Chaetodontidae": 272,
      "Chaetomiaceae": 273,
      "Chaetophoraceae": 274,
      "Chaetopteridae": 275,
      "Chaetosphaeriaceae": 276,
      "Chaetosphaeridiaceae": 277,
      "Chalinidae": 278,
      "Champiaceae": 279,
      "Channichthyidae": 280,
      "Channidae": 281,
      "Characeae": 282,
      "Charadriidae": 283,
      "Chattonellaceae": 284,
      "Cheiracanthiidae": 285,
      "Cheirogaleidae": 286,
      "Chelidae": 287,
      "Cheloniidae": 288,
      "Chelydridae": 289,
      "Chenopodiaceae": 290,
      "Chimaeridae": 291,
      "Chinchillidae": 292,
      "Chirodropidae": 293,
      "Chironomidae": 294,
      "Chiropsalmidae": 295,
      "Chiroteuthidae": 296,
      "Chitonidae": 297,
      "Chlamydomonadaceae": 298,
      "Chlamyphoridae": 299,
      "Chloranthaceae": 300,
      "Chlorellaceae": 301,
      "Chlorodendraceae": 302,
      "Chlorokybaceae": 303,
      "Chlorophthalmidae": 304,
      "Choanephoraceae": 305,
      "Chondrillidae": 306,
      "Chroicopteridae": 307,
      "Chromulinaceae": 308,
      "Chroomonadaceae": 309,
      "Chrysochloridae": 310,
      "Chrysochromulinaceae": 311,
      "Chrysomelidae": 312,
      "Cibotiaceae": 313,
      "Cicadellidae": 314,
      "Cicadidae": 315,
      "Cichlidae": 316,
      "Ciconiidae": 317,
      "Cimicidae": 318,
      "Cionidae": 319,
      "Cirolanidae": 320,
      "Cistaceae": 321,
      "Cistugidae": 322,
      "Cladiellidae": 323,
      "Cladoniaceae": 324,
      "Cladophoraceae": 325,
      "Cladosporiaceae": 326,
      "Clariidae": 327,
      "Clausiliidae": 328,
      "Clavicipitaceae": 329,
      "Clavulariidae": 330,
      "Clionaidae": 331,
      "Clitocybaceae": 332,
      "Clupeidae": 333,
      "Clusiaceae": 334,
      "Clypeasteridae": 335,
      "Clytiidae": 336,
      "Cobitidae": 337,
      "Coccinellidae": 338,
      "Codiaceae": 339,
      "Coelacanthidae": 340,
      "Colchicaceae": 341,
      "Coleochaetaceae": 342,
      "Coliidae": 343,
      "Colletidae": 344,
      "Colubridae": 345,
      "Columbidae": 346,
      "Combretaceae": 347,
      "Condylostomatidae": 348,
      "Congridae": 349,
      "Conidae": 350,
      "Conocephalaceae": 351,
      "Convolvulaceae": 352,
      "Coraciidae": 353,
      "Corallinaceae": 354,
      "Corcoracidae": 355,
      "Cordycipitaceae": 356,
      "Corellidae": 357,
      "Coriariaceae": 358,
      "Cornaceae": 359,
      "Corticiaceae": 360,
      "Cortinariaceae": 361,
      "Corvidae": 362,
      "Corydiidae": 363,
      "Corynesporascaceae": 364,
      "Corynocarpaceae": 365,
      "Costaceae": 366,
      "Cotingidae": 367,
      "Cottidae": 368,
      "Crabronidae": 369,
      "Cracidae": 370,
      "Crambidae": 371,
      "Crassulaceae": 372,
      "Cricetidae": 373,
      "Crocodylidae": 374,
      "Crotophagidae": 375,
      "Cryphonectriaceae": 376,
      "Crypthecodiniaceae": 377,
      "Cryptocercidae": 378,
      "Cryptococcaceae": 379,
      "Cryptopidae": 380,
      "Cryptosporidiidae": 381,
      "Ctenidae": 382,
      "Ctenodactylidae": 383,
      "Ctenomyidae": 384,
      "Cuculidae": 385,
      "Cucumariidae": 386,
      "Cucurbitaceae": 387,
      "Culicidae": 388,
      "Cunninghamellaceae": 389,
      "Cunoniaceae": 390,
      "Cupressaceae": 391,
      "Curculionidae": 392,
      "Cyaneidae": 393,
      "Cyanidiaceae": 394,
      "Cyanophoraceae": 395,
      "Cyatheaceae": 396,
      "Cycadaceae": 397,
      "Cyclopedidae": 398,
      "Cyclopteridae": 399,
      "Cylindrophiidae": 400,
      "Cynocephalidae": 401,
      "Cyphellophoraceae": 402,
      "Cypridinidae": 403,
      "Cyprinidae": 404,
      "Cyprinodontidae": 405,
      "Cyrillaceae": 406,
      "Cytosporaceae": 407,
      "Dactyloidae": 408,
      "Dactylopiidae": 409,
      "Dactylopteridae": 410,
      "Danionidae": 411,
      "Daphniidae": 412,
      "Daphniphyllaceae": 413,
      "Dasyatidae": 414,
      "Dasycladaceae": 415,
      "Dasypodidae": 416,
      "Dasyproctidae": 417,
      "Dasyuridae": 418,
      "Datiscaceae": 419,
      "Daubentoniidae": 420,
      "Debaryomycetaceae": 421,
      "Delphinidae": 422,
      "Dennstaedtiaceae": 423,
      "Derbesiaceae": 424,
      "Dermateaceae": 425,
      "Desmidiaceae": 426,
      "Diaporthaceae": 427,
      "Dichapetalaceae": 428,
      "Dicksoniaceae": 429,
      "Dicrocoeliidae": 430,
      "Dicroglossidae": 431,
      "Dictyosteliaceae": 432,
      "Dictyotaceae": 433,
      "Didelphidae": 434,
      "Didiereaceae": 435,
      "Didiniidae": 436,
      "Didymellaceae": 437,
      "Diguetidae": 438,
      "Dileptidae": 439,
      "Dilleniaceae": 440,
      "Dinomyidae": 441,
      "Diomedeidae": 442,
      "Dioscoreaceae": 443,
      "Diphyllobothriidae": 444,
      "Diphysciaceae": 445,
      "Diploglossidae": 446,
      "Dipodascaceae": 447,
      "Dipodidae": 448,
      "Dipsadidae": 449,
      "Dipteridaceae": 450,
      "Discosomidae": 451,
      "Ditrichaceae": 452,
      "Dothioraceae": 453,
      "Dreissenidae": 454,
      "Drepanopezizaceae": 455,
      "Dromaiidae": 456,
      "Droseraceae": 457,
      "Drosophilidae": 458,
      "Drosophyllaceae": 459,
      "Dryopteridaceae": 460,
      "Dugesiidae": 461,
      "Dugongidae": 462,
      "Dumortieraceae": 463,
      "Dunaliellaceae": 464,
      "Ebenaceae": 465,
      "Echimyidae": 466,
      "Echimyopodidae": 467,
      "Echinidae": 468,
      "Echinolampadidae": 469,
      "Echinometridae": 470,
      "Ectobiidae": 471,
      "Ectocarpaceae": 472,
      "Edwardsiidae": 473,
      "Ehretiaceae": 474,
      "Eimeriidae": 475,
      "Elaeagnaceae": 476,
      "Elaeocarpaceae": 477,
      "Elapidae": 478,
      "Elateridae": 479,
      "Eleginopidae": 480,
      "Eleotridae": 481,
      "Elephantidae": 482,
      "Eleutherodactylidae": 483,
      "Elsinoaceae": 484,
      "Emballonuridae": 485,
      "Empusidae": 486,
      "Emydidae": 487,
      "Enchytraeidae": 488,
      "Entamoebidae": 489,
      "Enterobacteriaceae": 490,
      "Enterocytozoonidae": 491,
      "Entolomataceae": 492,
      "Ephedraceae": 493,
      "Ephippidae": 494,
      "Equidae": 495,
      "Equisetaceae": 496,
      "Erebidae": 497,
      "Eremiaphilidae": 498,
      "Erethizontidae": 499,
      "Ericaceae": 500,
      "Erinaceidae": 501,
      "Erysiphaceae": 502,
      "Erythroxylaceae": 503,
      "Eschrichtiidae": 504,
      "Esocidae": 505,
      "Estrildidae": 506,
      "Eublepharidae": 507,
      "Eucommiaceae": 508,
      "Euctenizidae": 509,
      "Euglenaceae": 510,
      "Eulophidae": 511,
      "Euphausiidae": 512,
      "Euphorbiaceae": 513,
      "Eupleridae": 514,
      "Euplotidae": 515,
      "Euscorpiidae": 516,
      "Exidiaceae": 517,
      "Fabaceae": 518,
      "Fagaceae": 519,
      "Falconidae": 520,
      "Fasciolidae": 521,
      "Felidae": 522,
      "Filistatidae": 523,
      "Filobasidiaceae": 524,
      "Fissurellidae": 525,
      "Fomitopsidaceae": 526,
      "Formicidae": 527,
      "Fouquieriaceae": 528,
      "Fringillidae": 529,
      "Fucaceae": 530,
      "Funariaceae": 531,
      "Fundulidae": 532,
      "Fungiidae": 533,
      "Furipteridae": 534,
      "Furnariidae": 535,
      "Gadidae": 536,
      "Galagidae": 537,
      "Galdieriaceae": 538,
      "Garryaceae": 539,
      "Gasterosteidae": 540,
      "Gastromyzontidae": 541,
      "Gecarcinidae": 542,
      "Gekkonidae": 543,
      "Gelatinodiscaceae": 544,
      "Gelatoporiaceae": 545,
      "Gelsemiaceae": 546,
      "Geminigeraceae": 547,
      "Gentianaceae": 548,
      "Geodiidae": 549,
      "Geometridae": 550,
      "Geomyidae": 551,
      "Geoplanidae": 552,
      "Geotrupidae": 553,
      "Geraniaceae": 554,
      "Gigartinaceae": 555,
      "Ginglymostomatidae": 556,
      "Ginkgoaceae": 557,
      "Giraffidae": 558,
      "Glaucomidae": 559,
      "Gleicheniaceae": 560,
      "Gliridae": 561,
      "Gloeophyllaceae": 562,
      "Glomeraceae": 563,
      "Glomerellaceae": 564,
      "Glossinidae": 565,
      "Glossiphoniidae": 566,
      "Glyceridae": 567,
      "Glycyphagidae": 568,
      "Gnetaceae": 569,
      "Gobiidae": 570,
      "Gobionidae": 571,
      "Golfingiidae": 572,
      "Gonapodyaceae": 573,
      "Gonostomatidae": 574,
      "Gonyleptidae": 575,
      "Goodeniaceae": 576,
      "Gracilariaceae": 577,
      "Grapsidae": 578,
      "Grifolaceae": 579,
      "Grossulariaceae": 580,
      "Gruidae": 581,
      "Gryllidae": 582,
      "Gryllotalpidae": 583,
      "Gunneraceae": 584,
      "Gymnotidae": 585,
      "Hadrosauridae": 586,
      "Haemadipsidae": 587,
      "Haematococcaceae": 588,
      "Haemopidae": 589,
      "Halcuriidae": 590,
      "Halichondriidae": 591,
      "Halictidae": 592,
      "Haliotidae": 593,
      "Hamamelidaceae": 594,
      "Haplomitriaceae": 595,
      "Harpacticidae": 596,
      "Harpagiferidae": 597,
      "Harrimaniidae": 598,
      "Helicidae": 599,
      "Helicobacteraceae": 600,
      "Heligmosomidae": 601,
      "Helodermatidae": 602,
      "Helotiaceae": 603,
      "Hemiscorpiidae": 604,
      "Hemiscylliidae": 605,
      "Hemiselmidaceae": 606,
      "Hericiaceae": 607,
      "Herpestidae": 608,
      "Herpotrichiellaceae": 609,
      "Heterocapsaceae": 610,
      "Heteroderidae": 611,
      "Heterodontidae": 612,
      "Heteromyidae": 613,
      "Heteropneustidae": 614,
      "Hexamitidae": 615,
      "Hexathelidae": 616,
      "Himantandraceae": 617,
      "Hippopotamidae": 618,
      "Hipposideridae": 619,
      "Hirudinidae": 620,
      "Histionidae": 621,
      "Holocentridae": 622,
      "Holothuriidae": 623,
      "Homalopsidae": 624,
      "Hominidae": 625,
      "Homostichanthidae": 626,
      "Hookeriaceae": 627,
      "Hormathiidae": 628,
      "Hormuridae": 629,
      "Humiriaceae": 630,
      "Hyacinthaceae": 631,
      "Hyaenidae": 632,
      "Hyaloscyphaceae": 633,
      "Hydnangiaceae": 634,
      "Hydractiniidae": 635,
      "Hydrangeaceae": 636,
      "Hydridae": 637,
      "Hydrochaeridae": 638,
      "Hydrophyllaceae": 639,
      "Hygrophoraceae": 640,
      "Hylidae": 641,
      "Hylobatidae": 642,
      "Hylocomiaceae": 643,
      "Hymenochaetaceae": 644,
      "Hymenogastraceae": 645,
      "Hymenolepididae": 646,
      "Hymenomonadaceae": 647,
      "Hymenophyllaceae": 648,
      "Hymenopodidae": 649,
      "Hynobiidae": 650,
      "Hypericaceae": 651,
      "Hyperoliidae": 652,
      "Hypnaceae": 653,
      "Hypneaceae": 654,
      "Hypocreaceae": 655,
      "Hypopterygiaceae": 656,
      "Hypoxidaceae": 657,
      "Hypoxylaceae": 658,
      "Hypsibiidae": 659,
      "Hystricidae": 660,
      "Icacinaceae": 661,
      "Ichneumonidae": 662,
      "Ichthyophiidae": 663,
      "Ictaluridae": 664,
      "Iguanidae": 665,
      "Indostomidae": 666,
      "Indriidae": 667,
      "Iniidae": 668,
      "Iridaceae": 669,
      "Irpicaceae": 670,
      "Isochrysidaceae": 671,
      "Isoetaceae": 672,
      "Isoparorchiidae": 673,
      "Isophelliidae": 674,
      "Isotomidae": 675,
      "Istiophoridae": 676,
      "Ixodidae": 677,
      "Juglandaceae": 678,
      "Juncaceae": 679,
      "Kareniaceae": 680,
      "Klebsormidiaceae": 681,
      "Kryptoperidiniaceae": 682,
      "Labridae": 683,
      "Lacertidae": 684,
      "Lactoridaceae": 685,
      "Lamiaceae": 686,
      "Laminariaceae": 687,
      "Lampridae": 688,
      "Lamprophiidae": 689,
      "Lampyridae": 690,
      "Laniidae": 691,
      "Laridae": 692,
      "Lateolabracidae": 693,
      "Lauraceae": 694,
      "Lecythidaceae": 695,
      "Legeriomycetaceae": 696,
      "Lemuridae": 697,
      "Lentibulariaceae": 698,
      "Lepidosirenidae": 699,
      "Lepidoziaceae": 700,
      "Lepilemuridae": 701,
      "Lepismatidae": 702,
      "Lepisosteidae": 703,
      "Leporidae": 704,
      "Leptodactylidae": 705,
      "Leptosphaeriaceae": 706,
      "Leuciscidae": 707,
      "Leucodontaceae": 708,
      "Leucosporidiaceae": 709,
      "Libellulidae": 710,
      "Lichtheimiaceae": 711,
      "Liliaceae": 712,
      "Limacidae": 713,
      "Limacodidae": 714,
      "Limnanthaceae": 715,
      "Limnodynastidae": 716,
      "Limnoriidae": 717,
      "Limulidae": 718,
      "Linaceae": 719,
      "Linderniaceae": 720,
      "Lineidae": 721,
      "Lingulidae": 722,
      "Lingulodiniaceae": 723,
      "Liparidae": 724,
      "Lipomycetaceae": 725,
      "Liposcelididae": 726,
      "Lipotidae": 727,
      "Lithobiidae": 728,
      "Lithodidae": 729,
      "Littorinidae": 730,
      "Loasaceae": 731,
      "Loganiaceae": 732,
      "Loliginidae": 733,
      "Lonchitidaceae": 734,
      "Lonchodidae": 735,
      "Lophiidae": 736,
      "Lorisidae": 737,
      "Lottiidae": 738,
      "Loxocemidae": 739,
      "Loxodidae": 740,
      "Loxosomatidae": 741,
      "Lucinidae": 742,
      "Lumbricidae": 743,
      "Lycopodiaceae": 744,
      "Lycosidae": 745,
      "Lygaeidae": 746,
      "Lymnaeidae": 747,
      "Lyophyllaceae": 748,
      "Lythraceae": 749,
      "Macraucheniidae": 750,
      "Macrobiotidae": 751,
      "Macropodidae": 752,
      "Macroscelididae": 753,
      "Macrothelidae": 754,
      "Mactridae": 755,
      "Magnaporthaceae": 756,
      "Magnoliaceae": 757,
      "Majidae": 758,
      "Malasseziaceae": 759,
      "Malbrancheaceae": 760,
      "Malpighiaceae": 761,
      "Malvaceae": 762,
      "Mamiellaceae": 763,
      "Manidae": 764,
      "Mantidae": 765,
      "Mantophasmatidae": 766,
      "Marantaceae": 767,
      "Marasmiaceae": 768,
      "Marattiaceae": 769,
      "Marchantiaceae": 770,
      "Marsileaceae": 771,
      "Martyniaceae": 772,
      "Mastigamoebidae": 773,
      "Mastotermitidae": 774,
      "Megachilidae": 775,
      "Megadermatidae": 776,
      "Megalonychidae": 777,
      "Megalopidae": 778,
      "Megalopygidae": 779,
      "Megapodiidae": 780,
      "Megascolecidae": 781,
      "Megatheriidae": 782,
      "Melampsoraceae": 783,
      "Melanthiaceae": 784,
      "Melastomataceae": 785,
      "Meliaceae": 786,
      "Meliphagidae": 787,
      "Melithaeidae": 788,
      "Melittidae": 789,
      "Meloidogynidae": 790,
      "Melongenidae": 791,
      "Menispermaceae": 792,
      "Menyanthaceae": 793,
      "Mephitidae": 794,
      "Merlucciidae": 795,
      "Meruliaceae": 796,
      "Merulinidae": 797,
      "Mesostigmataceae": 798,
      "Metastrongylidae": 799,
      "Methanocaldococcaceae": 800,
      "Metridiidae": 801,
      "Metschnikowiaceae": 802,
      "Microascaceae": 803,
      "Microbiotheriidae": 804,
      "Microbotryaceae": 805,
      "Microdochiaceae": 806,
      "Milleporidae": 807,
      "Milnesiidae": 808,
      "Miniopteridae": 809,
      "Mitrocomidae": 810,
      "Molgulidae": 811,
      "Mollisiaceae": 812,
      "Molluginaceae": 813,
      "Molossidae": 814,
      "Molpadiidae": 815,
      "Monocleaceae": 816,
      "Monodontidae": 817,
      "Montiniaceae": 818,
      "Mopaliidae": 819,
      "Moraceae": 820,
      "Moringaceae": 821,
      "Mormoopidae": 822,
      "Moronidae": 823,
      "Mortierellaceae": 824,
      "Moschidae": 825,
      "Mrakiaceae": 826,
      "Mucoraceae": 827,
      "Mugilidae": 828,
      "Mullidae": 829,
      "Muraenesocidae": 830,
      "Muraenidae": 831,
      "Muricidae": 832,
      "Muridae": 833,
      "Musaceae": 834,
      "Muscicapidae": 835,
      "Muscidae": 836,
      "Musophagidae": 837,
      "Mustelidae": 838,
      "Mycenaceae": 839,
      "Mycobacteriaceae": 840,
      "Mycoplasmoidaceae": 841,
      "Mycosphaerellaceae": 842,
      "Myctophidae": 843,
      "Myidae": 844,
      "Mylodontidae": 845,
      "Myobatrachidae": 846,
      "Myocastoridae": 847,
      "Myricaceae": 848,
      "Myristicaceae": 849,
      "Myrmecobiidae": 850,
      "Myrmecophagidae": 851,
      "Myrtaceae": 852,
      "Mystacinidae": 853,
      "Mytilidae": 854,
      "Mytilinidiaceae": 855,
      "Myxinidae": 856,
      "Myxotrichaceae": 857,
      "Myzostomatidae": 858,
      "Naididae": 859,
      "Namaceae": 860,
      "Nandiniidae": 861,
      "Narcinidae": 862,
      "Narkidae": 863,
      "Nassariidae": 864,
      "Natalidae": 865,
      "Nautilidae": 866,
      "Neckeraceae": 867,
      "Nectriaceae": 868,
      "Nelumbonaceae": 869,
      "Nemacheilidae": 870,
      "Nemesiidae": 871,
      "Neobalaenidae": 872,
      "Neocallimastigaceae": 873,
      "Neocamarosporiaceae": 874,
      "Neodiplogasteridae": 875,
      "Neomorphidae": 876,
      "Nepenthaceae": 877,
      "Nephilidae": 878,
      "Nephrolepidaceae": 879,
      "Nephropidae": 880,
      "Nephroselmidaceae": 881,
      "Nephtheidae": 882,
      "Nereididae": 883,
      "Neritidae": 884,
      "Nesomyidae": 885,
      "Niphatidae": 886,
      "Nitidulidae": 887,
      "Nitrariaceae": 888,
      "Noctilionidae": 889,
      "Noctuidae": 890,
      "Noelaerhabdaceae": 891,
      "Nosematidae": 892,
      "Notodontidae": 893,
      "Notoryctidae": 894,
      "Nototheniidae": 895,
      "Numididae": 896,
      "Nyctaginaceae": 897,
      "Nyctotheridae": 898,
      "Nymphaeaceae": 899,
      "Nymphalidae": 900,
      "Nyssaceae": 901,
      "Obeliidae": 902,
      "Ochotonidae": 903,
      "Octodontidae": 904,
      "Octopodidae": 905,
      "Ocypodidae": 906,
      "Odobenidae": 907,
      "Odontaspididae": 908,
      "Odontophoridae": 909,
      "Oedogoniaceae": 910,
      "Oenonidae": 911,
      "Oestridae": 912,
      "Oikopleuridae": 913,
      "Oleaceae": 914,
      "Olindiidae": 915,
      "Olisthodiscaceae": 916,
      "Oltmannsiellopsidaceae": 917,
      "Ommastrephidae": 918,
      "Omphalotaceae": 919,
      "Onagraceae": 920,
      "Onchocercidae": 921,
      "Onocleaceae": 922,
      "Onychiuridae": 923,
      "Onygenaceae": 924,
      "Ophichthidae": 925,
      "Ophiocordycipitaceae": 926,
      "Ophioglossaceae": 927,
      "Ophiostomataceae": 928,
      "Opisthocomidae": 929,
      "Opisthorchiidae": 930,
      "Oplegnathidae": 931,
      "Oplophoridae": 932,
      "Orbiliaceae": 933,
      "Orchidaceae": 934,
      "Oreosomatidae": 935,
      "Ornithorhynchidae": 936,
      "Orobanchaceae": 937,
      "Orycteropodidae": 938,
      "Oscarellidae": 939,
      "Osmeridae": 940,
      "Osmundaceae": 941,
      "Osphronemidae": 942,
      "Osteoglossidae": 943,
      "Ostreidae": 944,
      "Otariidae": 945,
      "Oweniidae": 946,
      "Oxalidaceae": 947,
      "Oxyopidae": 948,
      "Oxyrrhinaceae": 949,
      "Oxytrichidae": 950,
      "Pachysolenaceae": 951,
      "Paeoniaceae": 952,
      "Palaemonidae": 953,
      "Palinuridae": 954,
      "Palmariaceae": 955,
      "Panaceae": 956,
      "Panagrolaimidae": 957,
      "Pandalidae": 958,
      "Pangasiidae": 959,
      "Pantodontidae": 960,
      "Papaveraceae": 961,
      "Papilionidae": 962,
      "Paradisaeidae": 963,
      "Paralichthyidae": 964,
      "Parameciidae": 965,
      "Paramphistomidae": 966,
      "Parastacidae": 967,
      "Parechinidae": 968,
      "Paridae": 969,
      "Parmeliaceae": 970,
      "Parodontellaceae": 971,
      "Parulidae": 972,
      "Passeridae": 973,
      "Passifloraceae": 974,
      "Patellidae": 975,
      "Paulinellidae": 976,
      "Paulowniaceae": 977,
      "Pavlovaceae": 978,
      "Paxillaceae": 979,
      "Pectinariidae": 980,
      "Pectinidae": 981,
      "Pedaliaceae": 982,
      "Pedetidae": 983,
      "Pediculidae": 984,
      "Pelliaceae": 985,
      "Pelomedusidae": 986,
      "Peltigeraceae": 987,
      "Penaeidae": 988,
      "Peniophoraceae": 989,
      "Pentadiplandraceae": 990,
      "Pentatomidae": 991,
      "Peramelidae": 992,
      "Percidae": 993,
      "Percopsidae": 994,
      "Peridiniaceae": 995,
      "Peripatidae": 996,
      "Perkinsidae": 997,
      "Peronosporaceae": 998,
      "Peroryctidae": 999,
      "Petauridae": 1000,
      "Petiveriaceae": 1001,
      "Petromyzontidae": 1002,
      "Petrosiidae": 1003,
      "Pfiesteriaceae": 1004,
      "Phacaceae": 1005,
      "Phaeodactylaceae": 1006,
      "Phaeolaceae": 1007,
      "Phaeomoniellaceae": 1008,
      "Phaeosphaeriaceae": 1009,
      "Phaffomycetaceae": 1010,
      "Phalacrocoracidae": 1011,
      "Phalangeridae": 1012,
      "Phanerochaetaceae": 1013,
      "Pharidae": 1014,
      "Phascolarctidae": 1015,
      "Phasianidae": 1016,
      "Phasmatidae": 1017,
      "Phellinaceae": 1018,
      "Philodromidae": 1019,
      "Phocidae": 1020,
      "Phocoenidae": 1021,
      "Phoenicopteridae": 1022,
      "Pholcidae": 1023,
      "Phoridae": 1024,
      "Phrymaceae": 1025,
      "Phrynosomatidae": 1026,
      "Phycomycetaceae": 1027,
      "Phyllodactylidae": 1028,
      "Phyllostomidae": 1029,
      "Phymanthidae": 1030,
      "Physalacriaceae": 1031,
      "Physaraceae": 1032,
      "Physeteridae": 1033,
      "Phytolaccaceae": 1034,
      "Pichiaceae": 1035,
      "Picidae": 1036,
      "Pieridae": 1037,
      "Pimelodidae": 1038,
      "Pinaceae": 1039,
      "Pinnidae": 1040,
      "Piperaceae": 1041,
      "Pipidae": 1042,
      "Pisolithaceae": 1043,
      "Pitheciidae": 1044,
      "Pittidae": 1045,
      "Plagiochilaceae": 1046,
      "Plakinidae": 1047,
      "Planorbidae": 1048,
      "Plantaginaceae": 1049,
      "Plasmodiidae": 1050,
      "Plasmodiophoridae": 1051,
      "Platanaceae": 1052,
      "Platanistidae": 1053,
      "Plecoglossidae": 1054,
      "Plectosphaerellaceae": 1055,
      "Plectreuridae": 1056,
      "Pleistophoridae": 1057,
      "Pleosporaceae": 1058,
      "Plethodontidae": 1059,
      "Pleurastraceae": 1060,
      "Pleuronectidae": 1061,
      "Pleurotaceae": 1062,
      "Plexauridae": 1063,
      "Ploettnerulaceae": 1064,
      "Plumbaginaceae": 1065,
      "Plutellidae": 1066,
      "Pneumocystaceae": 1067,
      "Poaceae": 1068,
      "Pocilloporidae": 1069,
      "Podargidae": 1070,
      "Podocarpaceae": 1071,
      "Podosporaceae": 1072,
      "Podostemaceae": 1073,
      "Poeciliidae": 1074,
      "Polemoniaceae": 1075,
      "Polybiidae": 1076,
      "Polycitoridae": 1077,
      "Polyclinidae": 1078,
      "Polygalaceae": 1079,
      "Polygonaceae": 1080,
      "Polyodontidae": 1081,
      "Polyorchidae": 1082,
      "Polyphysaceae": 1083,
      "Polyporaceae": 1084,
      "Polypteridae": 1085,
      "Polytrichaceae": 1086,
      "Pomatostomidae": 1087,
      "Pompilidae": 1088,
      "Pontederiaceae": 1089,
      "Pontoporiidae": 1090,
      "Poraniidae": 1091,
      "Porcellionidae": 1092,
      "Poritidae": 1093,
      "Porphyridiaceae": 1094,
      "Portulacaceae": 1095,
      "Portunidae": 1096,
      "Potamidae": 1097,
      "Potamididae": 1098,
      "Potamotrygonidae": 1099,
      "Potoroidae": 1100,
      "Pottiaceae": 1101,
      "Prasiolaceae": 1102,
      "Priapulidae": 1103,
      "Primulaceae": 1104,
      "Procaviidae": 1105,
      "Procellariidae": 1106,
      "Procyonidae": 1107,
      "Prorocentraceae": 1108,
      "Proteaceae": 1109,
      "Proteidae": 1110,
      "Protopteridae": 1111,
      "Protosiphonaceae": 1112,
      "Prymnesiaceae": 1113,
      "Psalteriomonadidae": 1114,
      "Psammobiidae": 1115,
      "Psathyrellaceae": 1116,
      "Pseudaphritidae": 1117,
      "Pseudocheiridae": 1118,
      "Pseudococcidae": 1119,
      "Pseudomonadaceae": 1120,
      "Psilidae": 1121,
      "Psilotaceae": 1122,
      "Psittacidae": 1123,
      "Psittaculidae": 1124,
      "Psoroptidae": 1125,
      "Psychidae": 1126,
      "Psychodidae": 1127,
      "Psyllidae": 1128,
      "Pteridaceae": 1129,
      "Pteriidae": 1130,
      "Pteromalidae": 1131,
      "Pteropodidae": 1132,
      "Ptilonorhynchidae": 1133,
      "Ptychomitriaceae": 1134,
      "Pucciniaceae": 1135,
      "Pulicidae": 1136,
      "Pyemotidae": 1137,
      "Pyralidae": 1138,
      "Pyrenochaetopsidaceae": 1139,
      "Pyrenomonadaceae": 1140,
      "Pyrgomorphidae": 1141,
      "Pyriculariaceae": 1142,
      "Pyrocystaceae": 1143,
      "Pyroglyphidae": 1144,
      "Pyronemataceae": 1145,
      "Pyrrhocoridae": 1146,
      "Pythiaceae": 1147,
      "Pythonidae": 1148,
      "Pyuridae": 1149,
      "Rajidae": 1150,
      "Rallidae": 1151,
      "Ramazzottiidae": 1152,
      "Ranellidae": 1153,
      "Ranidae": 1154,
      "Ranunculaceae": 1155,
      "Raperosteliaceae": 1156,
      "Raphidae": 1157,
      "Reduviidae": 1158,
      "Renillidae": 1159,
      "Reticulomyxidae": 1160,
      "Rhabditidae": 1161,
      "Rhacophoridae": 1162,
      "Rhadinorhynchidae": 1163,
      "Rhamnaceae": 1164,
      "Rheidae": 1165,
      "Rhinocerotidae": 1166,
      "Rhinocryptidae": 1167,
      "Rhinolophidae": 1168,
      "Rhinophrynidae": 1169,
      "Rhinopomatidae": 1170,
      "Rhizophoraceae": 1171,
      "Rhizopodaceae": 1172,
      "Rhizostomatidae": 1173,
      "Rhodellaceae": 1174,
      "Rhodomelaceae": 1175,
      "Rhynchogastremaceae": 1176,
      "Ricciaceae": 1177,
      "Rivulidae": 1178,
      "Romaleidae": 1179,
      "Roridulaceae": 1180,
      "Rosaceae": 1181,
      "Rubiaceae": 1182,
      "Russulaceae": 1183,
      "Rutaceae": 1184,
      "Sabellidae": 1185,
      "Saccharomycetaceae": 1186,
      "Saccharomycodaceae": 1187,
      "Saccharomycopsidaceae": 1188,
      "Saccotheciaceae": 1189,
      "Sagartiidae": 1190,
      "Salamandridae": 1191,
      "Salicaceae": 1192,
      "Salmonidae": 1193,
      "Salpingoecidae": 1194,
      "Salvadoraceae": 1195,
      "Salviniaceae": 1196,
      "Santalaceae": 1197,
      "Sapindaceae": 1198,
      "Sapotaceae": 1199,
      "Saprolegniaceae": 1200,
      "Sarcocystidae": 1201,
      "Sarcophagidae": 1202,
      "Sarcoptidae": 1203,
      "Sarcosomataceae": 1204,
      "Sareptidae": 1205,
      "Sarocladiaceae": 1206,
      "Sarraceniaceae": 1207,
      "Saturniidae": 1208,
      "Saururaceae": 1209,
      "Saxifragaceae": 1210,
      "Scarabaeidae": 1211,
      "Scenedesmaceae": 1212,
      "Schisandraceae": 1213,
      "Schistosomatidae": 1214,
      "Schizophyllaceae": 1215,
      "Schizosaccharomycetaceae": 1216,
      "Schizotheciaceae": 1217,
      "Sciadopityaceae": 1218,
      "Sciaenidae": 1219,
      "Sciaridae": 1220,
      "Scincidae": 1221,
      "Sciuridae": 1222,
      "Sclerotiniaceae": 1223,
      "Scoliidae": 1224,
      "Scolopacidae": 1225,
      "Scolopendridae": 1226,
      "Scombridae": 1227,
      "Scophthalmidae": 1228,
      "Scorpaenidae": 1229,
      "Scorpionidae": 1230,
      "Scrophulariaceae": 1231,
      "Scutigeridae": 1232,
      "Scyliorhinidae": 1233,
      "Scytodidae": 1234,
      "Scytosiphonaceae": 1235,
      "Sebastidae": 1236,
      "Segestriidae": 1237,
      "Selaginellaceae": 1238,
      "Selenastraceae": 1239,
      "Sepiidae": 1240,
      "Serendipitaceae": 1241,
      "Serpulaceae": 1242,
      "Serranidae": 1243,
      "Serrasalmidae": 1244,
      "Siboglinidae": 1245,
      "Sicariidae": 1246,
      "Siganidae": 1247,
      "Silphidae": 1248,
      "Siluridae": 1249,
      "Simaroubaceae": 1250,
      "Simmondsiaceae": 1251,
      "Simuliidae": 1252,
      "Sinipercidae": 1253,
      "Sipunculidae": 1254,
      "Skeletonemataceae": 1255,
      "Solanaceae": 1256,
      "Solasteridae": 1257,
      "Solecurtidae": 1258,
      "Soleidae": 1259,
      "Solieriaceae": 1260,
      "Somniosidae": 1261,
      "Sordariaceae": 1262,
      "Soricidae": 1263,
      "Spadellidae": 1264,
      "Spalacidae": 1265,
      "Sparassidae": 1266,
      "Sparidae": 1267,
      "Speleonectidae": 1268,
      "Sphaerobolaceae": 1269,
      "Sphaerocarpaceae": 1270,
      "Sphaerodactylidae": 1271,
      "Sphagnaceae": 1272,
      "Sphecidae": 1273,
      "Spheniscidae": 1274,
      "Sphenodontidae": 1275,
      "Sphenopidae": 1276,
      "Sphingidae": 1277,
      "Sphyraenidae": 1278,
      "Spirogyraceae": 1279,
      "Spizellomycetaceae": 1280,
      "Splachnaceae": 1281,
      "Spondylomoraceae": 1282,
      "Spongillidae": 1283,
      "Sporidiobolaceae": 1284,
      "Sporocadaceae": 1285,
      "Sporormiaceae": 1286,
      "Squalidae": 1287,
      "Stachybotryaceae": 1288,
      "Staphylococcaceae": 1289,
      "Stegnospermataceae": 1290,
      "Steinernematidae": 1291,
      "Stercorariidae": 1292,
      "Stereaceae": 1293,
      "Stereocaulaceae": 1294,
      "Stichodactylidae": 1295,
      "Stichopodidae": 1296,
      "Stomechinidae": 1297,
      "Stomiidae": 1298,
      "Stomolophidae": 1299,
      "Stratiomyidae": 1300,
      "Streptococcaceae": 1301,
      "Strigidae": 1302,
      "Strongylocentrotidae": 1303,
      "Strophariaceae": 1304,
      "Struthionidae": 1305,
      "Sturnidae": 1306,
      "Styelidae": 1307,
      "Styracaceae": 1308,
      "Suberitidae": 1309,
      "Suidae": 1310,
      "Suillaceae": 1311,
      "Sylviidae": 1312,
      "Symbiodiniaceae": 1313,
      "Synanceiidae": 1314,
      "Synbranchidae": 1315,
      "Syncephalastraceae": 1316,
      "Syndiniaceae": 1317,
      "Syngnathidae": 1318,
      "Synodontidae": 1319,
      "Syrphidae": 1320,
      "Tabanidae": 1321,
      "Tachyglossidae": 1322,
      "Taeniidae": 1323,
      "Taiwanofungaceae": 1324,
      "Takakiaceae": 1325,
      "Talitridae": 1326,
      "Talpidae": 1327,
      "Tanichthyidae": 1328,
      "Tapinellaceae": 1329,
      "Tapiridae": 1330,
      "Tarsiidae": 1331,
      "Tarsipedidae": 1332,
      "Taxaceae": 1333,
      "Tayassuidae": 1334,
      "Tectariaceae": 1335,
      "Tegulidae": 1336,
      "Teiidae": 1337,
      "Tellinidae": 1338,
      "Tenebrionidae": 1339,
      "Tenrecidae": 1340,
      "Tephritidae": 1341,
      "Teratosphaeriaceae": 1342,
      "Terebridae": 1343,
      "Termitidae": 1344,
      "Termopsidae": 1345,
      "Testudinidae": 1346,
      "Tetrahymenidae": 1347,
      "Tetraodontidae": 1348,
      "Thalassianthidae": 1349,
      "Thalassiosiraceae": 1350,
      "Theaceae": 1351,
      "Theileriidae": 1352,
      "Thelebolaceae": 1353,
      "Thelephoraceae": 1354,
      "Themistidae": 1355,
      "Theraphosidae": 1356,
      "Theridiidae": 1357,
      "Thermoascaceae": 1358,
      "Thespidae": 1359,
      "Thomisidae": 1360,
      "Thraupidae": 1361,
      "Thraustochytriidae": 1362,
      "Threskiornithidae": 1363,
      "Thripidae": 1364,
      "Thryonomyidae": 1365,
      "Thylacinidae": 1366,
      "Thymelaeaceae": 1367,
      "Thyropteridae": 1368,
      "Timaliidae": 1369,
      "Tinamidae": 1370,
      "Todidae": 1371,
      "Torpedinidae": 1372,
      "Tortricidae": 1373,
      "Toxocaridae": 1374,
      "Toxodontidae": 1375,
      "Toxopneustidae": 1376,
      "Trachipteridae": 1377,
      "Tragulidae": 1378,
      "Tremellaceae": 1379,
      "Triakidae": 1380,
      "Trichechidae": 1381,
      "Trichinellidae": 1382,
      "Trichocomaceae": 1383,
      "Trichogrammatidae": 1384,
      "Tricholomataceae": 1385,
      "Trichomonadidae": 1386,
      "Trichomonascaceae": 1387,
      "Trichoplacidae": 1388,
      "Trichosporonaceae": 1389,
      "Trichostrongylidae": 1390,
      "Trichuridae": 1391,
      "Triglidae": 1392,
      "Trigonopsidaceae": 1393,
      "Trimorphomycetaceae": 1394,
      "Trionychidae": 1395,
      "Tripedaliidae": 1396,
      "Tritrichomonadidae": 1397,
      "Trochidae": 1398,
      "Trochilidae": 1399,
      "Trochodendraceae": 1400,
      "Trogonidae": 1401,
      "Tropaeolaceae": 1402,
      "Tropidophiidae": 1403,
      "Trypanosomatidae": 1404,
      "Trypetheliaceae": 1405,
      "Tuberaceae": 1406,
      "Tupaiidae": 1407,
      "Tupiellaceae": 1408,
      "Turbinidae": 1409,
      "Turdidae": 1410,
      "Turnicidae": 1411,
      "Turridae": 1412,
      "Typhaceae": 1413,
      "Typhlonectidae": 1414,
      "Typhlopidae": 1415,
      "Typhulaceae": 1416,
      "Tyrannidae": 1417,
      "Tytonidae": 1418,
      "Ulmaceae": 1419,
      "Ulmaridae": 1420,
      "Ulvaceae": 1421,
      "Umbelopsidaceae": 1422,
      "Unikaryonidae": 1423,
      "Unionidae": 1424,
      "Uranoscopidae": 1425,
      "Urechidae": 1426,
      "Ursidae": 1427,
      "Urticaceae": 1428,
      "Ustilaginaceae": 1429,
      "Vaejovidae": 1430,
      "Vahlkampfiidae": 1431,
      "Varanidae": 1432,
      "Varunidae": 1433,
      "Vaucheriaceae": 1434,
      "Veneridae": 1435,
      "Venturiaceae": 1436,
      "Verbenaceae": 1437,
      "Vermamoebidae": 1438,
      "Vesicomyidae": 1439,
      "Vespertilionidae": 1440,
      "Vespidae": 1441,
      "Violaceae": 1442,
      "Viperidae": 1443,
      "Vireonidae": 1444,
      "Viscaceae": 1445,
      "Vitaceae": 1446,
      "Viverridae": 1447,
      "Volvocaceae": 1448,
      "Vombatidae": 1449,
      "Wallemiaceae": 1450,
      "Welwitschiaceae": 1451,
      "Wickerhamomycetaceae": 1452,
      "Winteraceae": 1453,
      "Xenocyprididae": 1454,
      "Xenopeltidae": 1455,
      "Xenoturbellidae": 1456,
      "Ximeniaceae": 1457,
      "Xiphiidae": 1458,
      "Xylariaceae": 1459,
      "Yponomeutidae": 1460,
      "Zamiaceae": 1461,
      "Zeidae": 1462,
      "Zingiberaceae": 1463,
      "Ziphiidae": 1464,
      "Zoanthidae": 1465,
      "Zoarcidae": 1466,
      "Zodariidae": 1467,
      "Zygnemataceae": 1468,
      "Zygophyllaceae": 1469
    },
    "unknown_idx": 0,
    "num_values": 1470
  },
  "family": {
    "value2idx": {
      "unknown": 0,
      "Accipitriformes": 1,
      "Acipenseriformes": 2,
      "Acorales": 3,
      "Acropomatiformes": 4,
      "Actiniaria": 5,
      "Acytosteliales": 6,
      "Adapedonta": 7,
      "Afrosoricida": 8,
      "Agaricales": 9,
      "Alaninales": 10,
      "Alismatales": 11,
      "Amborellales": 12,
      "Amiiformes": 13,
      "Amphidiniales": 14,
      "Amphioxiformes": 15,
      "Amphipoda": 16,
      "Amphisphaeriales": 17,
      "Amylocorticiales": 18,
      "Anabantiformes": 19,
      "Anguilliformes": 20,
      "Anostraca": 21,
      "Anseriformes": 22,
      "Anthoathecata": 23,
      "Anthocerotales": 24,
      "Anura": 25,
      "Apiales": 26,
      "Aplousobranchia": 27,
      "Aplysiida": 28,
      "Apochela": 29,
      "Apodiformes": 30,
      "Apterygiformes": 31,
      "Aquifoliales": 32,
      "Araneae": 33,
      "Araucariales": 34,
      "Arbacioida": 35,
      "Architaenioglossa": 36,
      "Arcoida": 37,
      "Arecales": 38,
      "Artiodactyla": 39,
      "Ascoideales": 40,
      "Asparagales": 41,
      "Aspidochirotida": 42,
      "Asterales": 43,
      "Atheliales": 44,
      "Atheriniformes": 45,
      "Aulopiformes": 46,
      "Auriculariales": 47,
      "Austrobaileyales": 48,
      "Axinellida": 49,
      "Azygiida": 50,
      "Bacillales": 51,
      "Bacillariales": 52,
      "Balanomorpha": 53,
      "Bangiales": 54,
      "Batrachoidiformes": 55,
      "Beloniformes": 56,
      "Bicosoecida": 57,
      "Blastocladiales": 58,
      "Blattodea": 59,
      "Blenniiformes": 60,
      "Boletales": 61,
      "Boraginales": 62,
      "Botryosphaeriales": 63,
      "Brassicales": 64,
      "Bruniales": 65,
      "Bryales": 66,
      "Bryopsidales": 67,
      "Burkholderiales": 68,
      "Buxales": 69,
      "Calanoida": 70,
      "Calobryales": 71,
      "Camarodonta": 72,
      "Campylobacterales": 73,
      "Canellales": 74,
      "Cantharellales": 75,
      "Capnodiales": 76,
      "Caprimulgiformes": 77,
      "Carangiformes": 78,
      "Carcharhiniformes": 79,
      "Cardiida": 80,
      "Carnivora": 81,
      "Carybdeida": 82,
      "Caryophyllales": 83,
      "Cassiduloida": 84,
      "Casuariiformes": 85,
      "Caudata": 86,
      "Celastrales": 87,
      "Centrarchiformes": 88,
      "Ceramiales": 89,
      "Ceratodontiformes": 90,
      "Ceratophyllales": 91,
      "Chaetodontiformes": 92,
      "Chaetophorales": 93,
      "Chaetosphaeriales": 94,
      "Chaetothyriales": 95,
      "Characiformes": 96,
      "Charadriiformes": 97,
      "Charales": 98,
      "Chattonellales": 99,
      "Cheilostomatida": 100,
      "Chimaeriformes": 101,
      "Chirodropida": 102,
      "Chiroptera": 103,
      "Chitonida": 104,
      "Chlamydomonadales": 105,
      "Chloranthales": 106,
      "Chlorellales": 107,
      "Chlorodendrales": 108,
      "Chlorokybales": 109,
      "Chondrillida": 110,
      "Chromulinales": 111,
      "Cichliformes": 112,
      "Ciconiiformes": 113,
      "Cingulata": 114,
      "Cladophorales": 115,
      "Cladosporiales": 116,
      "Clevelandellida": 117,
      "Clionaida": 118,
      "Clupeiformes": 119,
      "Clypeasteroida": 120,
      "Coccolithales": 121,
      "Coccosphaerales": 122,
      "Coelacanthiformes": 123,
      "Coleochaetales": 124,
      "Coleoptera": 125,
      "Coliiformes": 126,
      "Columbiformes": 127,
      "Commelinales": 128,
      "Copelata": 129,
      "Coraciiformes": 130,
      "Corallimorpharia": 131,
      "Corallinales": 132,
      "Cornales": 133,
      "Corticiales": 134,
      "Craspedida": 135,
      "Crassiclitellata": 136,
      "Crocodylia": 137,
      "Cryptomonadales": 138,
      "Cuculiformes": 139,
      "Cucurbitales": 140,
      "Cupressales": 141,
      "Cyanidiales": 142,
      "Cyanophorales": 143,
      "Cyatheales": 144,
      "Cycadales": 145,
      "Cycloneritida": 146,
      "Cyclophyllidea": 147,
      "Cypriniformes": 148,
      "Cyprinodontiformes": 149,
      "Cystofilobasidiales": 150,
      "Dasycladales": 151,
      "Dasyuromorphia": 152,
      "Decapoda": 153,
      "Dendrochirotida": 154,
      "Dermoptera": 155,
      "Desmidiales": 156,
      "Diaporthales": 157,
      "Dictyosteliales": 158,
      "Dictyotales": 159,
      "Didelphimorphia": 160,
      "Dilleniales": 161,
      "Dioscoreales": 162,
      "Diphyllobothriidea": 163,
      "Diphysciales": 164,
      "Diplomonadida": 165,
      "Diplostraca": 166,
      "Dipodascales": 167,
      "Diprotodontia": 168,
      "Dipsacales": 169,
      "Diptera": 170,
      "Dothideales": 171,
      "Echinorhynchida": 172,
      "Ectocarpales": 173,
      "Elopiformes": 174,
      "Enchytraeida": 175,
      "Enterobacterales": 176,
      "Entomobryomorpha": 177,
      "Ephedrales": 178,
      "Ephippiformes": 179,
      "Equisetales": 180,
      "Ericales": 181,
      "Erysiphales": 182,
      "Esociformes": 183,
      "Euamoebida": 184,
      "Eucoccidiorida": 185,
      "Euglenales": 186,
      "Euglyphida": 187,
      "Eulipotyphla": 188,
      "Eunicida": 189,
      "Euonychophora": 190,
      "Euphausiacea": 191,
      "Euplotida": 192,
      "Eupodiscales": 193,
      "Eurotiales": 194,
      "Fabales": 195,
      "Fagales": 196,
      "Falconiformes": 197,
      "Filobasidiales": 198,
      "Forcipulatida": 199,
      "Fucales": 200,
      "Funariales": 201,
      "Gadiformes": 202,
      "Galdieriales": 203,
      "Galliformes": 204,
      "Garryales": 205,
      "Geastrales": 206,
      "Gentianales": 207,
      "Geraniales": 208,
      "Gigartinales": 209,
      "Ginkgoales": 210,
      "Gleicheniales": 211,
      "Gloeophyllales": 212,
      "Glomerales": 213,
      "Glomerellales": 214,
      "Gnetales": 215,
      "Gobiiformes": 216,
      "Golfingiida": 217,
      "Gonyaulacales": 218,
      "Gracilariales": 219,
      "Grimmiales": 220,
      "Gruiformes": 221,
      "Gunnerales": 222,
      "Gymnodiniales": 223,
      "Gymnophiona": 224,
      "Gymnotiformes": 225,
      "Haemosporida": 226,
      "Haplosclerida": 227,
      "Haptorida": 228,
      "Harpacticoida": 229,
      "Harpellales": 230,
      "Helotiales": 231,
      "Hemiptera": 232,
      "Heterodontiformes": 233,
      "Heteronemertea": 234,
      "Heterotrichida": 235,
      "Hirudinida": 236,
      "Holocentriformes": 237,
      "Homosclerophorida": 238,
      "Hookeriales": 239,
      "Hymenochaetales": 240,
      "Hymenophyllales": 241,
      "Hymenoptera": 242,
      "Hymenostomatida": 243,
      "Hypnales": 244,
      "Hypocreales": 245,
      "Hyracoidea": 246,
      "Icacinales": 247,
      "Isochrysidales": 248,
      "Isoetales": 249,
      "Isopoda": 250,
      "Istiophoriformes": 251,
      "Ixodida": 252,
      "Jakobida": 253,
      "Jungermanniales": 254,
      "Klebsormidiales": 255,
      "Kriegeriales": 256,
      "Kurtiformes": 257,
      "Labriformes": 258,
      "Lactobacillales": 259,
      "Lagomorpha": 260,
      "Lamiales": 261,
      "Laminariales": 262,
      "Lamniformes": 263,
      "Lampriformes": 264,
      "Laurales": 265,
      "Lecanorales": 266,
      "Lepetellida": 267,
      "Lepidoptera": 268,
      "Leptothecata": 269,
      "Leucosporidiales": 270,
      "Liliales": 271,
      "Limnomedusae": 272,
      "Lingulida": 273,
      "Lipomycetales": 274,
      "Lithobiomorpha": 275,
      "Litopterna": 276,
      "Littorinimorpha": 277,
      "Lobata": 278,
      "Longamoebia": 279,
      "Lophiiformes": 280,
      "Loxodida": 281,
      "Lucinida": 282,
      "Lycopodiales": 283,
      "Macroscelidea": 284,
      "Magnaporthales": 285,
      "Magnoliales": 286,
      "Malacalcyonacea": 287,
      "Malasseziales": 288,
      "Malpighiales": 289,
      "Malvales": 290,
      "Mamiellales": 291,
      "Mantodea": 292,
      "Mantophasmatodea": 293,
      "Marattiales": 294,
      "Marchantiales": 295,
      "Mastigamoebida": 296,
      "Mesostigmatales": 297,
      "Methanococcales": 298,
      "Metzgeriales": 299,
      "Microascales": 300,
      "Microbiotheria": 301,
      "Microbotryales": 302,
      "Mischococcales": 303,
      "Molpadida": 304,
      "Monoblepharidales": 305,
      "Monotremata": 306,
      "Mortierellales": 307,
      "Mucorales": 308,
      "Mugiliformes": 309,
      "Musophagiformes": 310,
      "Mycobacteriales": 311,
      "Mycoplasmoidales": 312,
      "Mycosphaerellales": 313,
      "Myctophiformes": 314,
      "Myida": 315,
      "Myliobatiformes": 316,
      "Myodocopida": 317,
      "Myopsida": 318,
      "Myriangiales": 319,
      "Myrtales": 320,
      "Mytilida": 321,
      "Mytilinidiales": 322,
      "Myxiniformes": 323,
      "Myzostomida": 324,
      "Nautilida": 325,
      "Naviculales": 326,
      "Nectiopoda": 327,
      "Neocallimastigales": 328,
      "Neogastropoda": 329,
      "Nephroselmidales": 330,
      "Notoryctemorphia": 331,
      "Notoungulata": 332,
      "Nuculanida sp.": 333,
      "Nymphaeales": 334,
      "Octopoda": 335,
      "Odonata": 336,
      "Oedogoniales": 337,
      "Oegopsida": 338,
      "Oltmannsiellopsidales": 339,
      "Onygenales": 340,
      "Opalinata": 341,
      "Ophioglossales": 342,
      "Ophiostomatales": 343,
      "Opiliones": 344,
      "Opisthocomiformes": 345,
      "Opisthorchiida": 346,
      "Orbiliales": 347,
      "Orectolobiformes": 348,
      "Orthoptera": 349,
      "Osmeriformes": 350,
      "Osmundales": 351,
      "Osteoglossiformes": 352,
      "Ostreida": 353,
      "Oxalidales": 354,
      "Oxyrrhinales": 355,
      "Palmariales": 356,
      "Parabodonida": 357,
      "Parachela": 358,
      "Passeriformes": 359,
      "Paucituberculata": 360,
      "Pavlovales": 361,
      "Pectinida": 362,
      "Pelecaniformes": 363,
      "Pelliales": 364,
      "Peltigerales": 365,
